The Database Architect (Table Creation & SELECT)
Goal: Set up your first local database and retrieve specific data.
Scenario: You are building a system to track an internship cohort.
Instructions:
Create a database named internship.db using SQLite.
Create a table interns with columns: id, name, track (e.g., Data Science, Web Dev), and stipend.
Insert 5 rows of sample data.
Query: Write a SELECT statement to retrieve only the name and track of all interns.
Why: Understanding the difference between SELECT * (all) and specific columns is the first step toward writing efficient, professional queries.

In [2]:
import sqlite3

# Create or connect to database
conn = sqlite3.connect("internship.db")
cursor = conn.cursor()

In [3]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS interns (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT NOT NULL,
    track TEXT NOT NULL,
    stipend INTEGER
)
""")

conn.commit()

In [4]:
cursor.executemany("""
INSERT INTO interns (name, track, stipend)
VALUES (?, ?, ?)
""", [
    ("Archana", "Data Science", 15000),
    ("Rahul", "Web Dev", 12000),
    ("Sneha", "AI/ML", 18000),
    ("Kiran", "Data Science", 16000),
    ("Meena", "Web Dev", 13000)
])

conn.commit()

In [5]:
cursor.execute("SELECT name, track FROM interns")
result = cursor.fetchall()

for row in result:
    print(row)

('Archana', 'Data Science')
('Rahul', 'Web Dev')
('Sneha', 'AI/ML')
('Kiran', 'Data Science')
('Meena', 'Web Dev')

In [8]:
import pandas as pd

df = pd.read_sql_query("SELECT name, track FROM interns", conn)
df

      name         track
0  Archana  Data Science
1    Rahul       Web Dev
2    Sneha         AI/ML
3    Kiran  Data Science
4    Meena       Web Dev

In [9]:
conn.close()